[
  {
    "original_index": 32340,
    "url": "http://mashable.com/2014/09/08/safest-cabbies-nyc/",
    "domain": "mashable.com",
    "shares": 2900,
    "title": "New York City Recognizes Cautious Cabbies for the First Time | Mashable",
    "content_preview": "New York City taxi drivers don't have the greatest reputations. They make headlines for being rude, for illegally turning down passengers, and for injuring or even killing pedestrians.But on Monday, it was all good news at the first-ever ceremony honoring the safest New York City cabbies. SEE ALSO: Behind the Wheel: A Day in the Life of NYC Taxi Drivers \"I'm very honored to start a Monday morning with good news, with people doing the right thing, with people helping others,\" said New York City Mayor Bill de Blasio.The 2014 New York City Taxi and Limousine Commission (TLC) Safety Honor Roll is part of Vision Zero, a plan to prevent traffic deaths in the city the mayor unveiled in February.\"Drivers who put safety first should know how much we appreciate and value their work,\" TLC Chairwoman Meera Joshi said when announcing the list in August.To make the honor roll, cabbies must have no crashes causing injuries, no traffic violations, and no violations of TLC safety-related rules for at least five years. The average honored driver has held a TLC license for 13 years.About 26% of TLC licensed drivers -- a total of 295 out of 115,000 -- made the cut.The list includes 178 yellow taxi drivers, 110 black car or livery car drivers, four who drive both, and three who drive commuter vans. Eighteen of the honored drivers drive boro taxis. Winning drivers will receive a TLC placard to display in their cabs.Combined, the drivers have traveled 20 million miles and transported 8 million passengers, according to de Blasio, who said that taxi drivers in New York face the toughest environment in the world for doing what they do.\"You know in this town, anything can happen at any moment,\" he said, speaking to the audience of honored drivers. \"You have to not only drive in challenging circumstances, you have to be ready for literally the unexpected around every turn.\"The safest cabbies have impressive records.Among them is Frederick Amoafo, who has taken more than 50,000 passengers more ",
    "status": "success",
    "word_count": 336
  },
  {
    "original_index": 10480,
    "url": "http://mashable.com/2013/07/25/3d-printed-rifle/",
    "domain": "mashable.com",
    "shares": 1300,
    "title": "World's Possibly First 3D-Printed Rifle Is Fired on YouTube | Mashable",
    "content_preview": "A video showing what appears to be the first completely 3D-printed rifle in action was uploaded to YouTube on Wednesday.The video shows the plastic rifle, called \"the Grizzly,\" clamped to a workbench and the man who fires it (presumably the user who uploaded the video, ThreeD Ukelele) pulling a piece of string attached to the trigger for the test fire. The video's text indicates that the rifle employs the mainspring (the mechanism that causes the gun to fire) of Defense Distributed's Liberator, which is the first 3D-printed pistol. The rifle was printed on a Stratasys Dimension 1200es 3D printer. SEE ALSO: World's First 3D-Printed Gun Fired on Video In the video, the Grizzly appears to successfully fire a Winchester Dynapoint .22-caliber bullet, but the process puts two-inch cracks on the detachable barrel, and similar fractures along the top of the receiver, which houses the weapon's operating parts. A receiver is typically made of steel or aluminum though, in this case, \"like the Liberator, the only metal is a 1-inch roofing nail,\" according to the video description.ThreeD Ukulele also wrote in the description that changes will need to be made to the next version of the rifle, though he did not specify what those are. SEE ALSO: Officials: Stopping 3D-Printed Guns Could Be Impossible How do you feel about a 3D-printed arsenal? What sort of laws or regulation should there be around these weapons, if any? Let us know below and, for more, check out the video above.",
    "status": "success",
    "word_count": 247
  },
  {
    "original_index": 15370,
    "url": "http://mashable.com/2013/10/30/digital-dinosaur-movements/",
    "domain": "mashable.com",
    "shares": 17700,
    "title": "Giant Dinosaur Movements Digitally Recreated for First Time | Mashable",
    "content_preview": "Using advanced computer modeling techniques, researchers digitally reconstructed the movements of the Argentinosaurus dinosaur, enabling them to recreate how it walked and ran for the first time.[wp_scm_comment]",
    "status": "success",
    "word_count": 27
  },
  {
    "original_index": 31592,
    "url": "http://mashable.com/2014/08/27/homer-simpson-ice-bucket/",
    "domain": "mashable.com",
    "shares": 1500,
    "title": "Homer Simpson's Ice Bucket Challenge Is the Iciest Yet | Mashable",
    "content_preview": "Looks like even two-dimensional celebrities aren't off limits for the ALS Ice Bucket Challenge.Before pouring a small cup of water onto his head, Homer Simpson challenged his neighbor/sworn enemy Ned Flanders, his friend Lenny and Donald Trump, for good measure. And then things got interesting. [seealso slug=\"simpsons-predicted-technology\"]Trump, who was also nominated by WWE's Vince McMahon, has not yet responded to either challenge.BONUS: 5 'Simpsons' Facts You Might Not D'oh!",
    "status": "success",
    "word_count": 69
  },
  {
    "original_index": 198,
    "url": "http://mashable.com/2013/01/10/creepy-robotic-spider-dress/",
    "domain": "mashable.com",
    "shares": 1400,
    "title": "This Robotic Spider Dress Will Make Your Skin Crawl | Mashable",
    "content_preview": "As if spiders weren't creepy enough on their own, now you can wear one. High-tech fashion designer Anouk Wipprecht created an unsettling robotic spider dress, complete with animatronic arachnid limbs that jerk and twitch.Teaming up with Austrian software developer and hacker, Daniel Schatzmayr, Wipprecht makes hexapods haute. The dress has six robotic legs on its shoulder pads which respond to nearby movement.If anyone gets too close, the limbs move in closer to protect the wearer and keep strangers at bay (because everyone wants to snuggle up to someone decked out like an insect). Check out the video, above, for more.The Dutch-based designer showcased her dress at Cafe Neu Romance, an international robot performance festival in Prague, in November 2012. On her bio page, Wipprecht describes herself as \"part futuristic, part anime-meets-high fashion\" and pushes the boundaries between the physical and psychological.With the Spider Dress, Wipprecht explores the ideas of personal space, control and privacy. She describes it as a \"cute little host creature\" in her YouTube video, where warped voices set the track for the spider legs in action. SEE ALSO: These Futuristic Shoes Breathe and Ignite Her other out-of-the-ordinary designs include dresses with plastic tubes, fluids, inks and smart foils. The Daredroid is a cocktail-making robot dress, while Wipprecht's Intimacy line features dresses that become transparent based on the wearer's sensual interactions. The e-foils on Intimacy dresses respond to the person's heartbeat.Do you think we'll be seeing more robo-dresses? What do you think about the relationship between technology and fashion? Let us know your thoughts in the comments. Credit:",
    "status": "success",
    "word_count": 260
  },
  {
    "original_index": 37834,
    "url": "http://mashable.com/2014/11/27/prank-cash-thanksgiving/",
    "domain": "mashable.com",
    "shares": 2900,
    "title": "Pranksters give away cash to honest strangers for Thanksgiving | Mashable",
    "content_preview": "If you saw someone drop a ton of cash, would you tell them?American comedian and prankster Roman Atwood says in a YouTube video posted Thursday that he wanted to give away some money -- but in an unusual way. He repeatedly let a briefcase of cash fly open on city streets to see if anyone would tell him. SEE ALSO: 50 Amazingly Epic Pranks",
    "status": "success",
    "word_count": 64
  },
  {
    "original_index": 624,
    "url": "http://mashable.com/2013/01/17/pokki-windows-8-2/",
    "domain": "mashable.com",
    "shares": 801,
    "title": "Pokki's Start Button for Windows 8 Gets Even Better | Mashable",
    "content_preview": "When Windows 8 launched last year, Pokki came out with an app that brought the familiar Start menu back to the operating system.Now that Windows 8 has been out for a while, Pokki is updating the Pokki Start menu for Windows 8, updating the user interface and adding a number of customization features for users to make it their own.Pokki’s original app brought the traditional Start menu back to Windows 8, with an added twist.“We didn’t just bring back the old one, “ Chester Ng, co-founder and CMO of SweetLabs, told Mashable during a demo of the original app. “We agree with Microsoft that that one is outdated, and has a bunch of things that people don’t use. So we decided to take a familiar, yet modernized, take on what the start menu should be today.” Credit: Pokki’s Windows 8 app includes not only a Start button, but also a smartphone-like home screen where users can organize Pokki apps as well as websites, files, folders, and other Windows applications that are important to them. Just like on your smartphone, applications can be arranged however you like.Wednesday’s update offers easier access to settings and customizations in Windows 8, improved Search, and moves the notifications panel to a drop-down box, allowing for reduced Start menu width and easy access to app alerts.Pokki for Windows 8 is available now from the company’s website.",
    "status": "success",
    "word_count": 230
  },
  {
    "original_index": 22135,
    "url": "http://mashable.com/2014/03/20/emma-stone-spice-girls/",
    "domain": "mashable.com",
    "shares": 3000,
    "title": "Emma Stone Is Very Emotional About the Spice Girls | Mashable",
    "content_preview": "Emma Stone really really really wants to zig-a-zig-ahh.The actress and self-proclaimed huge Spice Girls fan was brought to tears this week when Mel B (a.k.a. Scary Spice) sent her a personalized message.[seealso slug=\"literally-dying-beyonce\"]That's right, Mel didn't even have to be in the same room as Emma for her emotions to overflow. While apologizing for her absence from the interview via pre-recorded message, Mel confronts The Amazing Spider-Man 2 actress about proclaiming Baby Spice as her favorite member of the girl power pop group.Emma then accepts the challenge to make amends by singing -- or rather, rapping -- a few of Mel's lines from \"Wannabe.\"BONUS: 16 Celebrities Immortalized as Barbies[nggallery id=15343]",
    "status": "success",
    "word_count": 110
  },
  {
    "original_index": 29798,
    "url": "http://mashable.com/2014/07/28/three-out-of-print-j-d-salinger-stories-republished/",
    "domain": "mashable.com",
    "shares": 1000,
    "title": "Three Out-of-Print J.D. Salinger Stories Are Now Legally Republished | Mashable",
    "content_preview": "Right under the noses of J.D. Salinger fans and the publishing world, three out-of-print short stories by Salinger were legally republished and have been available since May.The stories \"The Young Folks,\" \"Go See Eddie\" and \"Once a Week Won't Kill You\" were published by small, independent publisher Devault-Graves after a very careful, arduous process of acquiring the rights.[seealso slug=childrens-book-morals-adulthood]According to their website, the book, entitled Three Early Stories, was released in May 2014 in paperback, ebook, and audiobook formats, all available on Amazon.\"The Young Folks\" and \"Go See Eddie\" were the first and second stories Salinger ever published. All three stories have been previously published in magazines in the 1940s: \"The Young Folks\" in Story magazine in 1940, “Go See Eddie” in the University of Kansas City Review, also in 1940, and “Once a Week Won’t Kill You” in Story magazine in 1944.This book is the first by Salinger to be legally published since Salinger himself wrote the story \"Hapworth 16, 1924\" for The New Yorker in 1965.The 2013 documentary Salinger and the accompanying book started the mania over new Salinger work when it was revealed that previously unseen and unpublished fiction would be published from 2015-2020, per Salinger's own orders before his death in 2010. Devault and Graves were inspired to research the rights to Salinger's out-of-print stories after the documentary came out.According to Publisher's Weekly:Devault and Graves began to research the rights to the Salinger’s 21 early stories — all written before Catcher in the Rye was published in 1951 — after learning of their existence in Salinger, Shane Salerno’s 2013 documentary about the reclusive author. The pair discovered that three stories had never at any time been registered to Salinger. “We knew we had a shot at obtaining the rights,\" explained Graves, \"and the game began.”After an “exhaustive” search that involved a team of intellectual property attorneys a",
    "status": "success",
    "word_count": 311
  },
  {
    "original_index": 32896,
    "url": "http://mashable.com/2014/09/16/robot-cheetah-freed/",
    "domain": "mashable.com",
    "shares": 367,
    "title": "MIT's Robot Cheetah Is No Longer Bound to the Treadmill | Mashable",
    "content_preview": "Two years ago, MIT researchers showcased the first run of its cheetah-inspired robot, which could run 5.1 miles per hour, but only on a treadmill.Now, the team there has significantly improved the robot's capabilities. It can run twice as fast (10 mph), jump over 13-inch obstacles, and is no longer tethered to the treadmill.[seealso slug=\"bad-robots\"]Researchers have achieved this speed by developing a special algorithm for bounding, or leaping forward, a behavior which they observed in athletes.“Many sprinters, like Usain Bolt, don’t cycle their legs really fast,\" Sangbae Kim, an associate professor of mechanical engineering at MIT, told MIT News. \"They actually increase their stride length by pushing downward harder… so they can fly more while keeping the same frequency.\"The algorithm isn’t the only unique trait about the robot; the MIT researchers say it utilizes custom-built electric motors to make it “more stable, agile, and dynamic.” Comparable robots use gasoline engines, making them very loud. But MIT's updated robot cheetah, according to the researchers, can be \"silent and as efficient as animals.\"Their learnings will be used to improve prosthetics and bring technological advances to transportation.",
    "status": "success",
    "word_count": 184
  }
]